In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('Data_preprocessing.csv')

In [3]:
data.head()

     Country   Age   Salary Purchased
0  Australia  27.0  52000.0       Yes
1     Russia  25.0  49000.0       Yes
2      India  30.0  56000.0        No
3     Russia  29.0  54000.0        No
4      India  35.0  58000.0       Yes

# get _dummies

In [4]:
data1=data

In [5]:
data1.head()

     Country   Age   Salary Purchased
0  Australia  27.0  52000.0       Yes
1     Russia  25.0  49000.0       Yes
2      India  30.0  56000.0        No
3     Russia  29.0  54000.0        No
4      India  35.0  58000.0       Yes

In [6]:
dummies=pd.get_dummies(data1['Purchased'])   # or dummies=pd.get_dummies(data1.Purchased)

In [7]:
dummies.head()

   No  Yes
0   0    1
1   0    1
2   1    0
3   1    0
4   0    1

In [8]:
data1=pd.concat([data1,dummies],axis=1)

In [9]:
data1.head()

     Country   Age   Salary Purchased  No  Yes
0  Australia  27.0  52000.0       Yes   0    1
1     Russia  25.0  49000.0       Yes   0    1
2      India  30.0  56000.0        No   1    0
3     Russia  29.0  54000.0        No   1    0
4      India  35.0  58000.0       Yes   0    1

In [10]:
data1.drop(['Purchased','No'],axis=1).head()

     Country   Age   Salary  Yes
0  Australia  27.0  52000.0    1
1     Russia  25.0  49000.0    1
2      India  30.0  56000.0    0
3     Russia  29.0  54000.0    0
4      India  35.0  58000.0    1

# labelEncoder

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
data2=data

In [13]:
data2.head()

     Country   Age   Salary Purchased
0  Australia  27.0  52000.0       Yes
1     Russia  25.0  49000.0       Yes
2      India  30.0  56000.0        No
3     Russia  29.0  54000.0        No
4      India  35.0  58000.0       Yes

In [14]:
label=LabelEncoder()

In [15]:
data2['cate_purchased']=label.fit_transform(data2.Purchased)

In [16]:
data2.head()

     Country   Age   Salary Purchased  cate_purchased
0  Australia  27.0  52000.0       Yes               1
1     Russia  25.0  49000.0       Yes               1
2      India  30.0  56000.0        No               0
3     Russia  29.0  54000.0        No               0
4      India  35.0  58000.0       Yes               1

In [17]:
data2.drop('Purchased',axis=1).head()

     Country   Age   Salary  cate_purchased
0  Australia  27.0  52000.0               1
1     Russia  25.0  49000.0               1
2      India  30.0  56000.0               0
3     Russia  29.0  54000.0               0
4      India  35.0  58000.0               1

# OneHotEncoder

In [34]:
from sklearn.preprocessing import OneHotEncoder

In [35]:
data3=data

In [36]:
data3.head()

     Country   Age   Salary Purchased
0  Australia  27.0  52000.0       Yes
1     Russia  25.0  49000.0       Yes
2      India  30.0  56000.0        No
3     Russia  29.0  54000.0        No
4      India  35.0  58000.0       Yes

In [38]:
# data3.drop(('cate_purchased'),axis=1,inplace=True)

In [39]:
data3.head()

     Country   Age   Salary Purchased
0  Australia  27.0  52000.0       Yes
1     Russia  25.0  49000.0       Yes
2      India  30.0  56000.0        No
3     Russia  29.0  54000.0        No
4      India  35.0  58000.0       Yes

In [40]:
one=OneHotEncoder(sparse=False)

In [41]:
x=data3[['Purchased']]

In [42]:
one=one.fit_transform(x)

In [43]:
one

array([[0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.]])

In [44]:
one=one[:,1:]

In [45]:
one

array([[1.],
       [1.],
       [0.],
       [0.],
       [1.],
       [1.],
       [1.],
       [1.],
       [0.],
       [0.],
       [1.],
       [0.],
       [1.],
       [0.],
       [1.],
       [1.],
       [0.],
       [0.],
       [0.],
       [0.],
       [1.],
       [0.]])

In [47]:
one=pd.DataFrame(one)

In [50]:
data4=pd.concat([data3,one],axis=1)

In [51]:
data4

      Country   Age   Salary Purchased    0
0   Australia  27.0  52000.0       Yes  1.0
1      Russia  25.0  49000.0       Yes  1.0
2       India  30.0  56000.0        No  0.0
3      Russia  29.0  54000.0        No  0.0
4       India  35.0  58000.0       Yes  1.0
5      Russia  36.0  60000.0       Yes  1.0
6       India  37.0  61000.0       Yes  1.0
7   Australia  41.0  67000.0       Yes  1.0
8   Australia  38.0  65000.0        No  0.0
9      Russia  39.0  66000.0        No  0.0
10  Australia  40.0      NaN       Yes  1.0
11      India  40.0  72000.0        No  0.0
12     Russia  40.0      NaN       Yes  1.0
13      India  44.0  72000.0        No  0.0
14     Russia  48.0  79000.0       Yes  1.0
15      India  47.0  78000.0       Yes  1.0
16  Australia  50.0  83000.0        No  0.0
17     Russia  52.0  85000.0        No  0.0
18      India   NaN  61000.0        No  0.0
19  Australia   NaN  58000.0        No  0.0
20      India   NaN      NaN       Yes  1.0
21  Australia   NaN  58000.0        No  0.0

In [52]:
data4.head()

     Country   Age   Salary Purchased    0
0  Australia  27.0  52000.0       Yes  1.0
1     Russia  25.0  49000.0       Yes  1.0
2      India  30.0  56000.0        No  0.0
3     Russia  29.0  54000.0        No  0.0
4      India  35.0  58000.0       Yes  1.0

In [55]:
data4.drop(['Purchased'],axis=1).head()

     Country   Age   Salary    0
0  Australia  27.0  52000.0  1.0
1     Russia  25.0  49000.0  1.0
2      India  30.0  56000.0  0.0
3     Russia  29.0  54000.0  0.0
4      India  35.0  58000.0  1.0

# removeing the null values in the dataset

In [57]:
data.isnull().sum()

Country      0
Age          4
Salary       3
Purchased    0
dtype: int64

In [60]:
data.isnull().sum()*100/len(data)

Country       0.000000
Age          18.181818
Salary       13.636364
Purchased     0.000000
dtype: float64

In [61]:
data['Age']=data['Age'].fillna(data.Age.mean())

In [63]:
data.isnull().sum()*100/len(data)

Country       0.000000
Age           0.000000
Salary       13.636364
Purchased     0.000000
dtype: float64

In [64]:
data['Salary']=data['Salary'].fillna(data.Salary.mean())

In [66]:
data.isnull().sum()*100/len(data)

Country      0.0
Age          0.0
Salary       0.0
Purchased    0.0
dtype: float64